app/views/candies/grid.html.erb

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `candies` WHERE (is_candy = true) LIMIT 15) AS subquery
SELECT `candies`.* FROM `candies` WHERE (is_candy = true) ORDER BY created_at DESC LIMIT 15
---
<% @candies.each do |c| %>
<li class="pic_loading<%= ' discovered' if current_user && !c.users.empty? && (c.users.first.id == current_user.id && c.is_candy) %>">