app/views/users/candies.html.erb


  $.get(request, function(data) {
    if(data){
    $('li#candy_'+data.candy.candy.id).slideUp();
    }else{alert('Error!');}
  });
---
SELECT `candies`.* FROM `candies` INNER JOIN `candies_users` ON `candies`.id = `candies_users`.candy_id WHERE (`candies_users`.user_id = 1 ) ORDER BY created_at DESC