app/views/venues/_trending_venues.html.erb

SELECT `venues`.* FROM `venues` WHERE (`venues`.`id` = 11) LIMIT 1
---
<% session[:trending].each do |v|
venue = Venue.find(v)