app/views/venues/_venue_candies.html.erb

INSERT INTO `candies` (`created_at`, `data`, `flag`, `pid`, `score`, `updated_at`) VALUES ('2011-02-01 07:39:29', '--- \nphoto: http://playfoursquare.s3.amazonaws.com/userpix_thumbs/5GYZB5BUVD4SI5NH.jpg\nhomeCity: Jakarta, DKI Jakarta\nlastName: J.\ngender: female\nid: \"2401655\"\nfirstName: VINA\n', 0, '2401655', 0, '2011-02-01 08:48:43')
---
    <div class="checkin">
    <%= "#{time_ago_in_words(candy.created_at).capitalize} ago." %>