app/controllers/authentications_controller.rb

  def callback

    redirect_to root_url and return if !params[:code]

    if params[:error]

      redirect_to user_session_path

    else
      #@client = Authentication.authenticate
      provider = params[:provider]
      oauth_url = request.env['HTTP_HOST'] == 'spotcandy.com.localhost:3000' ? 'spotcandylocal.com' : @remote_host_url
      access_token = Authentication.req(provider).web_server.get_access_token(
        params[:code], :redirect_uri => "http://#{oauth_url}/auth/#{provider}/callback"
      )

      case provider
        when "foursquare"
          user = JSON.parse(Authentication.req(provider).request(:get, "https://api.foursquare.com/v2/users/self",
          :oauth_token => access_token.token))

          uid = user['response']['user']['id'].to_i
          user_email = user['response']['user']['contact']['email']
          user_data = user['response']['user']

        when "facebook"
          user = JSON.parse(access_token.get('/me'))
---
SELECT `authentications`.* FROM `authentications` WHERE (`authentications`.`uid` = 1151892) AND (`authentications`.`provider` = 'foursquare') LIMIT 1


      if authentication
        flash[:notice] = "Signed in successfully."
        authentication.update_attributes(:data => user_data)

        authentication.user.gender = user_data['gender']
        authentication.user.save
---
UPDATE `authentications` SET `data` = '--- \nphoto: http://playfoursquare.s3.amazonaws.com/userpix_thumbs/1VQGLXENZY0UGUPH.jpg\nfriends: \n groups: \n - items: []\n\n name: other friends\n count: 17\n type: others\n count: 17\npings: false\nhomeCity: Singapore\nlastName: N\ntodos: \n count: 0\ntips: \n count: 9\ncontact: \n facebook: \"606748610\"\n email: ngerchuyang@gmail.com\nrelationship: self\ngender: male\nid: \"1151892\"\nrequests: \n count: 0\ntype: user\nbadges: \n count: 9\nfirstName: Wilson\ncheckins: \n items: \n - timeZone: Asia/Singapore\n id: 4d4433622e326ea82a89e1a6\n type: checkin\n createdAt: 1296315234\n venue: \n name: Singapore Zoo\n location: \n city: Singapore\n address: Central Catchment Area\n lng: 103.793613910672\n lat: 1.40381455421444\n todos: \n count: 0\n stats: \n checkinsCount: 230\n usersCount: 202\n contact: {}\n\n id: 4cad2caa97c8a1cda188a7a5\n verified: false\n categories: \n - name: Zoo / Aquarium\n parents: \n - Arts & Entertainment\n primary: true\n icon: http://foursquare.com/img/categories/arts_entertainment/zoo.png\n id: 4bf58dd8d48988d17b941735\n count: 56\nmayorships: \n items: []\n\n count: 0\nfollowing: \n count: 0\n', `updated_at` = '2011-02-01 08:11:38' WHERE (`authentications`.`id` = 1)
UPDATE `users` SET `current_sign_in_at` = '2011-02-01 08:33:25', `last_sign_in_at` = '2011-02-01 08:32:32', `sign_in_count` = 3, `updated_at` = '2011-02-01 08:33:25' WHERE (`users`.`id` = 1)
INSERT INTO `authentications` (`access_token`, `created_at`, `data`, `provider`, `uid`, `updated_at`, `user_id`) VALUES ('24OT5HZ1UGXFKCOMPUVRBPTGMFQE4XHMQBI4EOTFVZNIWRSP', '2011-02-01 08:07:00', '--- \nphoto: http://playfoursquare.s3.amazonaws.com/userpix_thumbs/1VQGLXENZY0UGUPH.jpg\nfriends: \n groups: \n - items: []\n\n name: other friends\n count: 17\n type: others\n count: 17\npings: false\nhomeCity: Singapore\nlastName: N\ntodos: \n count: 0\ntips: \n count: 9\ncontact: \n facebook: \"606748610\"\n email: ngerchuyang@gmail.com\nrelationship: self\ngender: male\nid: \"1151892\"\nrequests: \n count: 0\ntype: user\nbadges: \n count: 9\nfirstName: Wilson\ncheckins: \n items: \n - timeZone: Asia/Singapore\n id: 4d4433622e326ea82a89e1a6\n type: checkin\n createdAt: 1296315234\n venue: \n name: Singapore Zoo\n location: \n city: Singapore\n address: Central Catchment Area\n lng: 103.793613910672\n lat: 1.40381455421444\n todos: \n count: 0\n stats: \n checkinsCount: 230\n usersCount: 202\n contact: {}\n\n id: 4cad2caa97c8a1cda188a7a5\n verified: false\n categories: \n - name: Zoo / Aquarium\n parents: \n - Arts & Entertainment\n primary: true\n icon: http://foursquare.com/img/categories/arts_entertainment/zoo.png\n id: 4bf58dd8d48988d17b941735\n count: 56\nmayorships: \n items: []\n\n count: 0\nfollowing: \n count: 0\n', 'foursquare', 1151892, '2011-02-01 08:07:00', 1)


        else
          # Check whether user account already exists
          if !User.find_by_email(user_email)
---
SELECT `users`.`id` FROM `users` WHERE (LOWER(`users`.`email`) = LOWER('ngerchuyang@gmail.com')) AND (`users`.id <> 1) LIMIT 1