app/controllers/candies_controller.rb

SELECT `candies`.* FROM `candies` WHERE (is_candy = true) ORDER BY created_at DESC LIMIT 15
---
  def grid
    #rand_id = rand(Candy.count)
    if params[:type] == 'nearby'
      @candies = Candy.where("is_candy = true").limit(15).order("created_at DESC").find_all_by_venue_id(session[:trending])
    end

    if params[:type] == 'recent'
      order = "created_at DESC"
      @candies = Candy.where("is_candy = true").order(order).limit(15)