app/controllers/pages_controller.rb

  def home
    #email = UserMailer.welcome_email.deliver
    #@candies = CandiesUser.limit(50).order("updated_at DESC").find( :all, :select => 'DISTINCT candy_id' )
    #@candies = CandiesUser.limit(50).order("updated_at DESC").find( :all, :group => 'candy_id' )
#    Candy.limit(50).select("id,pid,data,created_at,updated_at,score,venue_id,is_candy,rejected,flag_status").where("score > ?", 0).group("id").order("created_at")
    if !current_user
      @candies = Candy.includes(:venue,:photos).where("score > 0 AND is_candy = true").order("created_at DESC").limit(30)
---
SELECT `candies`.* FROM `candies` WHERE (score > 0 AND is_candy = true) ORDER BY created_at DESC LIMIT 30
SELECT `photos`.* FROM `photos` WHERE (`photos`.candy_id IN (2569,3870,1432,2509,110,199,6872,6191,5556,7114,8730,3866,4606,6887,9509,9510,9511,9512,9471,6434,1030,9280,9263,7362,3781,9238,3992,9208,7721,7988))
SELECT `venues`.* FROM `venues` WHERE (`venues`.`id` IN (183,56,79,57,6897,15,60,50,6515,6900,178,20,146,98,5826,6981,269))