app/controllers/registrations_controller.rb

  def create
    build_resource

    if resource.save
      if resource.active_for_authentication?
        set_flash_message :notice, :signed_up if is_navigational_format?
        sign_in(resource_name, resource)

        UserMailer.join_mail(resource, User.count).deliver
---
SELECT COUNT(*) AS count_id FROM `users`