app/controllers/users_controller.rb

SELECT `candies`.* FROM `candies` INNER JOIN `candies_users` ON `candies`.id = `candies_users`.candy_id WHERE (`candies_users`.user_id = 1 ) ORDER BY created_at DESC
---
  def candies

    authenticate_user!

    # Offset page = 0 if coming from 'My Portfolio'
    session[:candies_offset] = 0 if (session[:candies_offset].nil? || params[:offset])

    @limit = 20
    @max = get_max_candy
    session[:venue_candies_back] = 'portfolio'
    @candy_status_list = []

    @title = "My Portfolio"

    # Eg. User's score must be >= 70% of scout's score
    #@score = 100

    #@user_candies_list = current_user.candies.where("recommended = ?", true).map{|c| c.id}
    @candy_status_list = Candy.candy_status_list
    #@candies = @scout.candies.where("recommended = ?", true).order("updated_at DESC")
    @candies = current_user.candies.where("recommended = ?", true).order("updated_at DESC")

    @candies.each do |candy|

SELECT `authentications`.* FROM `authentications` WHERE (`authentications`.user_id = 1) AND (`authentications`.`provider` = 'foursquare') LIMIT 1
---
  def show
    @user = current_user
    @foursquare = current_user.authentications.where(:provider => 'foursquare').first