app/controllers/venues_controller.rb


            if !result.empty?
              session[:random_venues] = result
              @venue = Venue.find(session[:random_venues].pop)
---
SELECT `venues`.* FROM `venues` WHERE (`venues`.`id` = 45) LIMIT 1